# DATA(690) ASSIGNMENT - 6

In [1]:
# Setting up a new dataframe using Pandas read_html() function.
import pandas as pd
df = pd.read_html("https://www.genealogybranches.com/censuscosts.html")

In [3]:
#Number of html tables in the dataframe
len(df)

2

In [5]:
#Loading the two HTML tabels into two seperate dataframes
df_1 = df[0]
df_2 = df[1]

In [6]:
df_1

              0                 1               2                        3
0   Census Year  Total Population     Census Cost  Average Cost Per Person
1          1790           3929214         $44,377               1.13 cents
2          1800           5308483         $66,109               1.24 cents
3          1810           7239881        $178,445               2.46 cents
4          1820           9633822        $208,526               2.16 cents
5          1830          12866020        $378,545               2.94 cents
6          1840          17069458        $833,371               4.88 cents
7          1850          23191876      $1,423,351               6.14 cents
8          1860          31443321      $1,969,377               6.26 cents
9          1870          38558371      $3,421,198               8.87 cents
10         1880          50155783      $5,790,678              11.54 cents
11         1890          62979766     $11,547,127              18.33 cents
12         1900          76303387     $11,854,000              15.54 cents
13         1910          91972266     $15,968,000              17.07 cents
14         1920         105710620     $25,117,000              23.76 cents
15         1930         122775046     $40,156,000              32.71 cents
16         1940         131669275     $67,527,000              51.29 cents
17         1950         151325798     $91,462,000              60.44 cents
18         1960         179323175    $127,934,000              71.34 cents
19         1970         203302031    $247,653,000                    $1.22
20         1980         226542199  $1,078,488,000                    $4.76
21         1990         248718301  $2,492,830,000                   $10.02
22         2000         281421906    $4.5 Billion                   $15.99
23        2010*         308745538     $13 Billion                   $42.11

In [7]:
df_2

                                                   0
0  The U.S. population reached 300,000,000 on 17 ...

### df_1 is the useful data frame as it is having the required information.

In [8]:
# Applying info() function to the dataframe df_1 to check the null values
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24 entries, 0 to 23
Data columns (total 4 columns):
0    24 non-null object
1    24 non-null object
2    24 non-null object
3    24 non-null object
dtypes: object(4)
memory usage: 896.0+ bytes

In [9]:
# Applying describe function on our dataframe
df_1.describe()

           0          1             2            3
count     24         24            24           24
unique    24         24            24           24
top     1890  248718301  $127,934,000  32.71 cents
freq       1          1             1            1

In [10]:
# Making the column name as header
df_1.columns = df_1.iloc[0]
df_1 = df_1.drop(df_1.index[0])

#### Function to cleanse the year

In [11]:
def cleanser_year(str1):
    str2 = str1.replace("*","")
    return str2

#### Testing

In [12]:
cleanser_year("1989*")

'1989'

In [13]:
cleanser_year("20*10")

'2010'

#### Applying the clense_year() function to "Census Year" column

In [14]:
df_1["Census Year"] = df_1["Census Year"].apply(cleanser_year)

#### Converting the datatype of Census Year and Total Population columns to int type

In [15]:
df_1["Census Year"] = df_1["Census Year"].astype(int)

In [16]:
df_1["Total Population"] = df_1["Total Population"].astype(int)

#### Function to cleanse the Census Cost column

In [17]:
def cleanse_cost(str1):
    str1 = str1.replace(" Billion","000000000")
    str1 = str1.replace("$","")
    str1 = str1.replace(",","")
    return str1

#### Testing

In [18]:
cleanse_cost("$13 Billion")

'13000000000'

#### CLeansing the Census Cost column by the  help of cleanse_cost() function.

In [19]:
df_1["Census Cost"] = df_1["Census Cost"].apply(cleanse_cost)

In [20]:
df_1["Census Cost"] = df_1["Census Cost"].astype(float)

#### Function to cleanse the AvgCost column

In [21]:
def cleanse_Avgcost(str1):
    if "cents" in str1:
        str1 = str1.replace(" cents","")
        str1 = float(str1)/100
    else:
        str1 = str1.replace("$","")
    return (str1)

#### Testing

In [24]:
cleanse_Avgcost("2.3 cents")

0.023

In [26]:
cleanse_Avgcost("$66.22")

'66.22'

#### Applying cleanse_Avgcost function to "Average Cost Per Person" column

In [27]:
df_1["Average Cost Per Person"] = df_1["Average Cost Per Person"].apply(cleanse_Avgcost)

In [28]:
df_1["Average Cost Per Person"] = df_1["Average Cost Per Person"].astype(float)

#### Dataframe that is ready to use

In [29]:
df_1

0   Census Year  Total Population   Census Cost  Average Cost Per Person
1          1790           3929214  4.437700e+04                   0.0113
2          1800           5308483  6.610900e+04                   0.0124
3          1810           7239881  1.784450e+05                   0.0246
4          1820           9633822  2.085260e+05                   0.0216
5          1830          12866020  3.785450e+05                   0.0294
6          1840          17069458  8.333710e+05                   0.0488
7          1850          23191876  1.423351e+06                   0.0614
8          1860          31443321  1.969377e+06                   0.0626
9          1870          38558371  3.421198e+06                   0.0887
10         1880          50155783  5.790678e+06                   0.1154
11         1890          62979766  1.154713e+07                   0.1833
12         1900          76303387  1.185400e+07                   0.1554
13         1910          91972266  1.596800e+07                   0.1707
14         1920         105710620  2.511700e+07                   0.2376
15         1930         122775046  4.015600e+07                   0.3271
16         1940         131669275  6.752700e+07                   0.5129
17         1950         151325798  9.146200e+07                   0.6044
18         1960         179323175  1.279340e+08                   0.7134
19         1970         203302031  2.476530e+08                   1.2200
20         1980         226542199  1.078488e+09                   4.7600
21         1990         248718301  2.492830e+09                  10.0200
22         2000         281421906  4.500000e+00                  15.9900
23         2010         308745538  1.300000e+10                  42.1100

#### Exporting the modified dataframe into a csv file

In [30]:
df_1.to_csv("census_cost_cleansed.csv", index=False)